# YOLOv11 3D base configuration
# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80  # number of classes
ch: 1   # input channels

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv3d, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv3d, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv3d, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv3d, [512, 3, 2]]  # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv3d, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat3d, [1]]  # cat backbone P4
  - [-1, 3, C3, [512, False]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat3d, [1]]  # cat backbone P3
  - [-1, 3, C3, [256, False]]  # 15 (P3/8-small)

  - [-1, 1, Conv3d, [256, 3, 2]]
  - [[-1, 12], 1, Concat3d, [1]]  # cat head P4
  - [-1, 3, C3, [512, False]]  # 18 (P4/16-medium)

  - [-1, 1, Conv3d, [512, 3, 2]]
  - [[-1, 9], 1, Concat3d, [1]]  # cat head P5
  - [-1, 3, C3, [1024, False]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect3D, [nc]]  # Detect(P3, P4, P5) 