nc: 80  # number of classes
scales:  # model scales
  # [depth_multiple, width_multiple, max_channels]
  n: [0.50, 0.25, 1024]  # YOLOv11n-3d parameters
  s: [0.50, 0.50, 1024]  # YOLOv11s-3d parameters
  m: [0.50, 1.00, 512]   # YOLOv11m-3d parameters
  l: [1.00, 1.00, 512]   # YOLOv11l-3d parameters
  x: [1.00, 1.50, 512]   # YOLOv11x-3d parameters

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv3d, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv3d, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2_3d, [256, False, 0.25]]
  - [-1, 1, Conv3d, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2_3d, [512, False, 0.25]]
  - [-1, 1, Conv3d, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2_3d, [512, True]]
  - [-1, 1, Conv3d, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2_3d, [1024, True]]
  - [-1, 1, SPPF3d, [1024, 5]]  # 9
  - [-1, 2, C2PSA3d, [1024]]  # 10

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat3d, [1]]  # cat backbone P4
  - [-1, 2, C3k2_3d, [512, False]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat3d, [1]]  # cat backbone P3
  - [-1, 2, C3k2_3d, [256, False]]  # 16 (P3/8-small)

  - [-1, 1, Conv3d, [256, 3, 2]]
  - [[-1, 13], 1, Concat3d, [1]]  # cat head P4
  - [-1, 2, C3k2_3d, [512, False]]  # 19 (P4/16-medium)

  - [-1, 1, Conv3d, [512, 3, 2]]
  - [[-1, 10], 1, Concat3d, [1]]  # cat head P5
  - [-1, 2, C3k2_3d, [1024, True]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect3D, [nc]]  # Detect(P3, P4, P5)